'''
Создайте список-словарь 10 товаров и их цен. Выведите их в виде столбца. Найдите среднюю цену.
Выведите списком товары с ценой ниже средней. Добавьте в словарь еще 3 произвольных записи.
'''
x = [[],[],[]]
sl = {1: 250,
          2: 36,
          3: 346,
          4: 365,
          5: 366,
          6: 37,
          7: 368,
          8: 361,
          9: 6,
          10: 36}
for k in range(1,len(sl)+1):
    print(k,': ',sl[k])
avg = (sum(sl.values())/len(sl)) #avg
print('Среднее',avg)
for i in range(1,len(sl)+1):
    if sl.get(i) <= avg:
        print('Цена ниже минимальной у товара: ', i)
for j in range(3):
    print('Введите цену нового товара: ')
    a = j+11
    x[j].append(a)
    x[j].append(input())
x = dict(x)
sl = {**sl, **x}
#sl = dict.update(dict(x))
print(sl)
    

